# ReinforcementData Class

---
Abstract class for various reinforcement data
SystemObject Autodesk.Revit.DB.StructureReinforcementData Autodesk.Revit.DB.StructureRebarReinforcementData
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ReinforcementData : IDisposable

    Public Class ReinforcementData
    	Implements IDisposable

    public ref class ReinforcementData : IDisposable

    type ReinforcementData =
        class
            interface IDisposable
        end
The ReinforcementData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ReinforcementData
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace